
#include"Matrix(with_SLAU).h"


int main() 
{
	setlocale(LC_ALL, "Russian");


	cout << "                                                          \n";
	cout << "Матрицу нельзя решить.                                           \n";
	cout << "Решить можно только Систему Линейных Алгебраических Уравнений (СЛАУ)\n";
	cout << "По СЛАУ можно построить матрицу.                                 \n";
	cout << "Матрицу мы не можем решить, но зато можем упростить по методу Гаусса.\n";
	cout << "                                                                 \n";
	cout << "                                                          \n";
	cout << "                                                          \n";
	cout << " Пример СЛАУ и построенной по СЛАУ матрицы                \n";
	cout << "                                                          \n";
	cout << "                                                          \n";
	cout << " СЛАУ:                                                    \n";
	cout << "                                                          \n";
	cout << " 3x + 5y + 9z = 28                                        \n";
	cout << " 7x + 7y + 7z = 42                                        \n";
	cout << "  x   +   13z = 16            _                           \n";
	cout << "                              v - вектор                  \n";
	cout << "                                                          \n";
	cout << "                                                          \n";
	cout << " Построенная по СЛАУ матрица:        A*v=b                \n";
	cout << "                                                          \n";
	cout << "    (  3  5  9  | 28  )                                   \n";
	cout << "   (   7  7  7  | 42   )                                  \n";
	cout << "    (  1  0  13 | 16  )                                   \n";
	cout << "                                                          \n";
	cout << "      \n                                                    \n";
	cout << " Упрощенная матрица по методу Гаусса (использовалась данная программа):\n";
	cout << "                                                          \n";
	cout << "     (  3       0        0  |     9     )      --> 3*x = 9           \n";
	cout << "    (   0    -4.66667    0  | -9.33333   )     --> -4.66667*y = -9.33333          \n";
	cout << "     (  0       0        15 |    15     )      --> 15*z = 15          \n";
	cout << "          \n                                                \n";
	cout << " Полученный вектор v = ( 3 , 2 , 1 )   , что означает  x=3 y=2 z=1 \n";
	cout << "\n\n\n\n\nНажмите на любую клавишу чтобы продолжить...\n";

	int c;

	c = _getch();

	system("CLS");




	try {  //  будем искать и ловить исключения в мэйне

		int n;
		int type;
		bool noCorrectAnswer = true;

		while (noCorrectAnswer)
		{
			cout << "                                                          \n";
			cout << "                                                          \n";
			cout << "                    <>< МЕНЮ ><>                          \n";
			cout << " ________________________________________________________ \n";
			cout << "|                                                        |\n";
			cout << "|     > Выберите тип данных                              |\n";
			cout << "|                                                        |\n";
			cout << "|                                                        |\n";
			cout << "| 1) double [рациональные]                               |\n";
			cout << "|                                                        |\n";
			cout << "| 2) другого нет   [ X ]                                 |\n";
			cout << "|                                                        |\n";
			cout << "|                                                        |\n";
			cout << "|     > Введите цифру нужного вам типа данных            |\n";
			cout << "|                                                        |\n";
			cout << "|________________________________________________________|\n";

			cout << "\n\n\n\n\n Ваш тип данных > ";
			cin >> type;

			system("CLS");

			if (type == 1 ) noCorrectAnswer = false;
			else
			{
				cout << "                                                          \n";
				cout << "                                                          \n";
				cout << "       _________________                                  \n";
				cout << "      |                 |                                 \n";
				cout << "      |  Ошибка ввода ! |                                 \n";
				cout << "      |_________________|                                 \n";
				cout << "                                                          \n";
				cout << "      > Ожидалась одна из цифр:  1 или    х [2] x         \n";
				cout << "                                                          \n";
				cout << "                                                          \n";
			}

		}
		

		cout << "                                                                                       \n";
		cout << "                                                                                       \n";
		cout << " _____________________________________________________________________________________ \n";
		cout << "|                                                                                     |\n";
		cout << "|  > Теперь Вам нужно ввести размер матрицы                                           |\n";
		cout << "|  <( Матрица A будет иметь размер [ n x n ] )  -->  матрица А - квадратная:  >       |\n";
		cout << "|                                                                длина строки  = n    |\n";
		cout << "|                                                                длина столбца = n    |\n";
		cout << "|_____________________________________________________________________________________|\n";
		cout << "                                                                                       \n";
		cout << "                                                                                       \n";
		cout << "    Ваш размер матрицы A[n x n]:      n =  "; if (type == 6) cout << "\n\n\n\n\n\n\n\n\n                                                                           9\n\n\n\n\n\n      n =  ";
		cin >> n;

		system("CLS");

		if (n <= 0)
		{
			throw MyException(1);
		}

		cout << "   И последнее                                                 \n";
		cout << "                                                               \n";
		cout << " _____________________________________________________________ \n";
		cout << "|                                                             |\n";
		cout << "| > Вам нужно поочерёдно ввести значения элементов матрицы    |\n";
		cout << "| > элементы пишутся в строку !                               |\n";
		cout << "|                                    строка 1: x1 -> y1 -> z1 |\n";
		cout << "|                                    строка 2: x2 -> y2 -> z2 |\n";
		cout << "|                                    и т.д.                   |\n";
		cout << "|_____________________________________________________________|\n";
		cout << "\n\n\n\n\nНажмите на любую клавишу чтобы начать...\n";

		c = _getch();

		system("CLS");

		cout << "\n\n\n\n";



	
			Matrix<double> Matr(n);
			cout << "\n\n        > СЛАУ\n\n";
			Matr << cout;
			Matr.Method_Gaussa();
		

			cout << "----->  [Программа завершилась не выдав ни одного исключения и ошибки]\n";

	
	}
	catch (MyException& e)
	{
		cout << "\n\n";
		e.show();
	}

}